#pragma once
//================================================
//DirectXシューティングゲーム
//Author:鈴木聖大
//================================================
#ifndef _BG2_H_			// 2重インクルード防止のマクロ定義
#define _BG2_H_

#define _CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"
//================================================
//プロトタイプ宣言
//================================================
void InitBg2(void);
void UninitBg2(void);
void UpdateBg2(void);
void DrawBg2(void);

#endif