//================================================
//DirectXシューティングゲーム
//Author:鈴木聖大
//================================================
#ifndef _BG3_H_			// 2重インクルード防止のマクロ定義
#define _BG3_H_

#define _CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"
//================================================
//プロトタイプ宣言
//================================================
void InitBg3(void);
void UninitBg3(void);
void DrawBg3(void);

#endif