//---------------------------------------------
//タイトル :ダイレクトX　弾発射[score.h]
//Author:伊藤大輝
//---------------------------------------------
#ifndef _TIMER_H_
#define _TIMER_H_
#define _CRT_SECURE_NO_WARNINGS_

//---------------------------------------------
// インクルードファイル
//---------------------------------------------
#include"main.h"

//=============================================================================
//マクロ定義
//=============================================================================
#define NUMBER_SIZE_X (30.0f) //スコアの横のサイズ
#define NUMBER_SIZE_Y (70.0f)   //スコアの縦のサイズ
#define MAX_TIMER (3)//スコアの桁の数

//=============================================================================
//プロトタイプ宣言
//=============================================================================
void InitTimer(void);   //初期化処理
void UpdateTimer(void);   //更新処理
void UninitTimer(void);   //終了処理
void DrawTimer(void);   //描画処理
int GetTimer(void);
void StopTimer(void);
#endif

//HitEnemyに、ScoreEffect(任意のポイント); を入れれば、スコア加算