//================================================
//DirectXシューティングゲーム
//Author:鈴木聖大
//================================================
#ifndef _TITLE_H_			// 2重インクルード防止のマクロ定義
#define _TITLE_H_

#define _CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"
//================================================
//プロトタイプ宣言
//================================================
void InitTitle(void);
void UninitTitle(void);
void UpdateTitle(void);
void DrawTitle(void);

#endif