//=============================================================================
//
// チュートリアル処理(スコアアタックモード) [tutorial_score_attack.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _TUTORIAL_SCORE_ATTACK_H_
#define _TUTORIAL_SCORE_ATTACK_H_

//*****************************************************************************
//ヘッダファイルのインクルード
//*****************************************************************************
#include "mode.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CScore;
class CUi;

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CTutorialScoreAttack :public CMode
{
public:
	CTutorialScoreAttack();
	~CTutorialScoreAttack();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void AddScore(int nNum);

private:
	CScore *m_pScore;			//スコアのポインタ
	CUi* m_pDescriptionUi;		//操作説明のポインタ
};

#endif