//================================================
//3Dゲーム制作
//Author:鈴木聖大
//================================================
#ifndef LIGHT_H_
#define LIGHT_H_

#define CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"

//================================================
//プロトタイプ宣言
//================================================
void InitLight(void);
void UninitLight(void);
void UpdateLight(void);

#endif