//================================================
//3Dゲーム制作
//Author:鈴木聖大
//================================================
#ifndef POLYGON_H_
#define POLYGON_H_

#define CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"

//================================================
//マクロ定義
//================================================
#define POLYGON_SIZE (780)	//床の大きさ

//================================================
//プロトタイプ宣言
//================================================
void InitPolygon(void);
void UninitPolygon(void);
void UpdatePolygon(void);
void DrawPolygon(void);

#endif