//================================================
//DirectXシューティングゲーム
//Author:鈴木聖大
//================================================
#ifndef _RESULT_H_			// 2重インクルード防止のマクロ定義
#define _RESULT_H_

#define _CRT_SECURE_NO_WARNINGS

//================================================
//インクルードファイル
//================================================
#include "main.h"

//=====================================================
// マクロ定義
//=====================================================
#define COUNT_WAIT_START_GAME (60)//ゲーム画面を更新するまでの時間
#define COUNT_WAIT_FINISH_GAME (60)//リザルト画面を表示するまでの時間

//================================================
//プロトタイプ宣言
//================================================
void InitResult(void);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif