//=============================================================================
//
// ポーズ処理 [pause.h]
// Author : Suzuki Mahiro
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

//*****************************************************************************
//ヘッダファイルのインクルード
//*****************************************************************************
#include "scene.h"

//*****************************************************************************
//前方宣言
//*****************************************************************************
class CUi;

//*****************************************************************************
//クラス定義
//*****************************************************************************
class CPause :public CScene
{
public:
	//ポーズ画面の項目の列挙型
	typedef enum
	{
		MENU_CONTINUE = 0,		//続ける
		MENU_INSTRUCTION,		//操作説明
		MENU_START_OVER,		//最初からやり直す
		MENU_RETURN_TO_SELECT,	//セレクトに戻る
		MENU_MAX			
	}MENU;

	CPause();
	~CPause();
	static CPause *Create(void);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:
	CUi *m_apMenuUi[MENU_MAX];	//ポーズメニューUIの生成
	CUi *m_pUi;					//ポーズ背景(枠)UIの生成
	CUi *m_pInstructionUi;		//操作説明UIの生成
	int m_nChoiceNum;			//選択中のメニューの配列番号
	bool m_bStickMove;			//スティックを傾けているかどうかの判定
};

#endif